src/test/java/com/cydeo/day10/dau10 notes .txt

Can you do assertion if you are getting xml response in restassured ?
You have talked about verifiying json response, can you do verification with xml payload ?

Yes,just liike jsonPath we have xmlPath class from response object in restassured library.
so I know how to retrieve value from xml response. with xmlpath I can get any tag value or attrivute value and do needed assertion.

       XmlPath xmlPath = response.xmlPath();

        //get given name
        String givenName = xmlPath.getString("MRData.DriverTable.Driver.GivenName");

        //if you are trying to get attribute we use @ sign
        String driverId = xmlPath.getString("MRData.DriverTable.Driver.@driverId");

we navigate between parent child with using . and if there are multiple elements we can use index[0,1,2..]

in order to get attribute we use @ sign.


======================================
SOAP (Simple OBject Access Protocol)

-It has strict rule on how to send request and response
-Soap request use XMl format to send and receive response
-ONLY method allowed in SOAP is POST
-The content type is always XML
-Body is enclosed in envelop like structure example;

ONE SOAP REQUEST

-URL: https://www.dataaccess.com/webservicesserver/NumberConversion.wso

-Request Header: Content-Type text/xml; charset=utf-8

-Request Body :

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <NumberToWords xmlns="http://www.dataaccess.com/webservicesserver/">
      <ubiNum>500</ubiNum>
    </NumberToWords>
  </soap:Body>
</soap:Envelope>

Example Response:

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <m:NumberToWordsResponse xmlns:m="http://www.dataaccess.com/webservicesserver/">
            <m:NumberToWordsResult>five hundred </m:NumberToWordsResult>
        </m:NumberToWordsResponse>
    </soap:Body>
</soap:Envelope>

============================================
============================================
How to verify response time with Restassured library ?

Once we sent the request, after then(). method there is time(matchers) method which takes the response time and based on the matcher we provide, it will do assertion.

we can use greaterThan(),lessThan(), or both at the same time

        .then()
                .statusCode(200)
                .and()
                .time(both(greaterThan(500L)).and(lessThan(1200L)))
                .extract().response();

we can also get the value out of response object with response.getTime() method.

===========================================